# базовый образ linux с установленным питоном, на котором собираем свой образ
FROM python:3.11
# создаем директорию внутри контейнера, куда скопируем наш сервис.
# Атоматически переключаемся на нее и далее, все команды ниже будут выполняться в ней
WORKDIR /app
# копируем проект в /app
# левая точка - корень нашего проекта на хост машине
# правая точка - папка /app
# "точка" в unix - это текущее место, где ты стоишь
COPY . .
# установка зависимостей
RUN pip install -r requirements.txt
# cli команда запуска сервиса
CMD python app.py